n = 250;
a = -1;
b = 1;
hx = (b-a)/n;
x = (a:hx:b-hx); 
y = (a:hx:b-hx);

[X,Y] = meshgrid(x,y);

sg = 0.1; 
cnm = 200;                                  %Коэффициент полиномов Цернике
Cn = 10+1i;                                 %Коэффициент перед суммой
z = input("Введите число z: ");             %расстояние в мм 500 или 1000
wl = 0.0005;                                %длина волны в мм 0.0005
kw = 2*pi/wl;                               %Волновое число

%астигматизм 3-го порядка
%f2 = exp(1i * cnm * (X.^2 - Y.^2)); 

%кома 3-го порядка представленная полиномами Цернике
%f2 = exp(1i * cnm * (3*X.^3 + 3*X.*Y.^2));

%расфокусировка представленная полиномами Цернике
%f2 = exp (1i * cnm * (2*X.^2 + 2*Y.^2 - 1)); 
    
%Функция Гаусса
M1 = 2;
M2 = -5;
M3 = 8;
%f0 = exp(-(X.^2+Y.^2)/sg^2);                #просто пятно
f = exp(-(X.^2+Y.^2)/sg^2) .* (Cn .* (((X+1i*sign(M1).*Y)/sg).^abs(M1))); %кольцо
%f0 = exp(-(X.^2+Y.^2)/sg^2) .*(Cn .* (((X+1i*sign(M1).*Y)/sg).^abs(M1)) + 5 .* (((X+1i*sign(M2).*Y)/sg).^abs(M2)));
#f = exp(-(X.^2+Y.^2)/sg^2) .* (Cn .* (((X+1i*sign(M1).*Y)/sg).^abs(M1)) + 5 .* (((X+1i*sign(M2).*Y)/sg).^abs(M2)) + 8.*(((X+1i*sign(M3).*Y)/sg).^abs(M3))); #вихрь 

%Мода Гаусса-Лагерра для частного случая, когда N = 0
r = sqrt(X.^2 + Y.^2);
M = 6;
%f = exp((-r.^2)./(2*sg^2)).*((X+1i*sign(M).*Y).^abs(M));

%f = f0 .* f2;

#Строю изображения
figure(1)
imagesc(arg(f))
colorbar;
title('Фаза исходной функции');

figure(2)
imagesc((abs(f)).^2)
colorbar;
title('Интенсивность исходной функции');

%m = 1024;
m = 512;
%m = 256;
#Пересчитываю область
p = ((n^2)*wl*z)/(4*b*m);
q = -p;
hu = (p-q)/n;

u = (q:hu:p - hu);
v = (q:hu:p - hu);

F = FrenelTransform(m, n, X, Y, u, v, f, hx, kw, z); #Выполняю преобразование Френеля

#Строю изображения
figure(3)
imagesc(u, v, arg(F))
colorbar;
title('Фаза после пр Френеля');

figure(4)
imagesc(u, v, (abs(F)).^2)
colorbar;
title('Интенсивность после пр Френеля');
